"""
МОДУЛЬ 3
Программа "Личный счет"
Описание работы программы:
Пользователь запускает программу у него на счету 0
Программа предлагает следующие варианты действий
1. пополнить счет
2. покупка
3. история покупок
4. выход

1. пополнение счета
при выборе этого пункта пользователю предлагается ввести сумму на сколько пополнить счет
после того как пользователь вводит сумму она добавляется к счету
снова попадаем в основное меню

2. покупка
при выборе этого пункта пользователю предлагается ввести сумму покупки
если она больше количества денег на счете, то сообщаем что денег не хватает и переходим в основное меню
если денег достаточно предлагаем пользователю ввести название покупки, например (еда)
снимаем деньги со счета
сохраняем покупку в историю
выходим в основное меню

3. история покупок
выводим историю покупок пользователя (название и сумму)
возвращаемся в основное меню

4. выход
выход из программы
"""


def more_money() -> int:
    "Запрашивает и возвращает количество денег для пополнения счета"

    return int(input("Пожалуйста, введите сумму для пополнения счета: "))


def buy(acc, amount_buy):
    """
    Позволяет купить что-либо на имеющиеся у вас деньги
    :param acc: ваш текущий счет
    :param amount_buy: сумма, которую вы готовы потратить
    :return: оставшаяся сумма на счете, ваша покупка и потраченная на нее сумма
    """

    target_buy = input("Введите название покупки: ")
    acc -= amount_buy
    return acc, target_buy, amount_buy


def main1():
    account: int = 0
    holder = {}
    while True:
        print('\n1. пополнение счета\n'
              '2. покупка\n'
              '3. история покупок\n'
              '4. выход')

        choice = input('Выберите пункт меню: ')
        match choice:
            case '1':
                account += more_money()

            case '2':
                amount = int(input("Введите сумму покупки: "))
                if amount > account:
                    print("\nНедостаточно средств")
                    continue
                account, target, amount = buy(account, amount)
                holder[target] = amount

            case '3':
                print("\n")
                for key, value in holder.items():
                    print(f"{key}: {value}")

            case '4':
                break

            case _:
                print('Неверный пункт меню')

if __name__ == "__main__":
    main1()
