print("Давайте сыграем в викторину!\nЯ загадываю вам известного человека, а вы называете год его рождения)\n")
score=0
if int(input("Александр Невский\t"))==1220: score+=1
if int(input("Иван Грозный\t"))==1530: score+=1
if int(input("Пётр Первый\t"))==1672: score+=1
if int(input("Екатерина Вторая\t"))==1729: score+=1
if int(input("Владимир Ульянов\t"))==1870: score+=1
if int(input("Михаил Ломоносов\t"))==1711: score+=1

print(f"Давайте подсчитаем ваши баллы. \nВсего было 6 вопросов, на {score} из них вы ответили верно\n"
      f"Но вот на {6-score} вы дали неверный ответ.\n"
      f"В процентах:  {round(score*100/6,2)} правильных ответов и {100 - round(score*100/6,2)} неправильных")
