import random

def question_game():
    base = {
        "Александр Пушкин": "06.06.1799",
        "Николай Пирогов": "13.11.1810",
        "Фёдор Достоевский": "11.11.1821",
        "Лев Толстой": "09.09.1828",
        "Дмитрий Менделеев": "08.02.1834",
        "Пётр Чайковский": "07.05.1840",
        "Иван Павлов": "26.09.1849",
        "Владимир Вернадский": "12.03.1863",
        "Владимир Ленин": "22.04.1870",
        "Иосиф Джугашвили": "18.12.1878",
        "Сергей Королёв": "12.01.1907"
    }
    quest = random.sample(list(base), 5)
    values = [base[k] for k in quest]
    ans = []
    count = 0

    print("Выбраны пять известных людей. Введите их даты рождения в формате DD:MM:YYYY")
    for i in range(len(quest)):
        ans.append(input(f"{quest[i]}: "))
        if ans[i] != values[i]: print(f"Неправильно! Ответ - {date_to_text(values[i])}")
        count += 1

    print(f"\nКоличество неправильных ответов - {count}, правильных - {5 - count}")


def date_to_text(date_str):
    day, month, year = date_str.split('.')

    days = {
        '01': 'Первое', '02': 'Второе', '03': 'Третье', '04': 'Четвертое',
        '05': 'Пятое', '06': 'Шестое', '07': 'Седьмое', '08': 'Восьмое',
        '09': 'Девятое', '10': 'Десятое', '11': 'Одиннадцатое', '12': 'Двенадцатое',
        '13': 'Тринадцатое', '14': 'Четырнадцатое', '15': 'Пятнадцатое',
        '16': 'Шестнадцатое', '17': 'Семнадцатое', '18': 'Восемнадцатое',
        '19': 'Девятнадцатое', '20': 'Двадцатое', '21': 'Двадцать первое',
        '22': 'Двадцать второе', '23': 'Двадцать третье', '24': 'Двадцать четвертое',
        '25': 'Двадцать пятое', '26': 'Двадцать шестое', '27': 'Двадцать седьмое',
        '28': 'Двадцать восьмое', '29': 'Двадцать девятое', '30': 'Тридцатое',
        '31': 'Тридцать первое'
    }

    months = {
        '01': 'января', '02': 'февраля', '03': 'марта', '04': 'апреля',
        '05': 'мая', '06': 'июня', '07': 'июля', '08': 'августа',
        '09': 'сентября', '10': 'октября', '11': 'ноября', '12': 'декабря'
    }

    day_text = days.get(day, '')
    month_text = months.get(month, '')

    return f'{day_text} {month_text} {year} года'


if __name__ == "__main__":
    while input("Нажмите Enter, чтобы продолжить...\n") == "":
        question_game()